const ulCategories = document.querySelector("#categories"); 
//Група методів elem.querySelector* - це сучасний стандарт для пошуку елементів. Вони дозволяють знайти елемент або групу елементів за CSS-селектором будь-якої складності.
//Використовується, якщо необхідно знайти тільки один, найчастіше унікальний елемент.
const ulCategoriesLength = ulCategories.children.length;    //Порахує!
//Властивість Children, доступне тільки для читання, повертає активну HTMLCollection, що містить усі дочірні елементи елемента, для якого було викликано.
console.log(`Number of categories: ${ulCategoriesLength}`);     //Виведе в консоль!

const liItemsElements = document.querySelectorAll(".item");
//elem.querySelectorAll - використовується, якщо необхідно знайти колекцію елементів, тобто отримати масив посилань на елементи з однаковим селектором.
liItemsElements.forEach((item) => {     //Знайде і виведе в консоль!
    console.log("Category: ", item.firstElementChild.textContent);//Властивість textContent інтерфейсу Node представляє текстовий вміст вузла та його нащадків.
    console.log("Elements: ", item.lastElementChild.children.length);
});
//Метод forEach() є ітеративним методом. Він викликає надану функцію callbackFn один раз для кожного елемента масиву в порядку зростання індексу. На відміну від map(), forEach() завжди повертає невизначене значення і не може бути об'єднаний у ланцюжок. Типовий варіант використання – виконання побічних ефектів у кінці ланцюжка.
//Функція зворотного дзвінка — це функція, яка передається в іншу функцію як аргумент, який потім викликається всередині зовнішньої функції для виконання будь-якої процедури або дії.
 

